#-------------------------------------------------------------------------------
# Name:        task7
# Purpose: Напишите программу, доказывающую или проверяющую, что для множества натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
# где n - любое натуральное число.
#
# Author:      DautkhadzhievRKH
#
# Created:     11.03.2019
# Copyright:   (c) DautkhadzhievRKH 2019
# Licence:     <your licence>
#-------------------------------------------------------------------------------

n = int(input('Введите число n: '))
i = 1
summa = 0
while i <= n:
    summa += i # левое выражение
    val = n * (n + 1) / 2 # правое выражение
    i += 1
if summa == val:
    print('%d = %d. Равенство верно' % (summa, val))
