#-------------------------------------------------------------------------------
# Name:        task9
# Purpose: Вводятся три разных числа.
#Найти, какое из них является средним (больше одного, но меньше другого).
#
# Author:      DautkhadzhievRKH
#
# Created:     09.03.2019
# Copyright:   (c) DautkhadzhievRKH 2019
# Licence:     <your licence>
#-------------------------------------------------------------------------------

a = int(input('1-е число = '))
b = int(input('2-е число = '))
c = int(input('3-е число = '))
if a == b or a == c or b == c or (a == b and b == c):
    print('Неправильный ввод! Найдены совпадающие числа')
elif a <= b <= c or c <= b <= a:
    print('Среднее число', b)
elif b <= a <= c or c <= a <= b:
    print('Среднее число', a)
else:
    print('Среднее число', c)
