#-------------------------------------------------------------------------------
# Name:        task5
# Purpose: Пользователь вводит две буквы.
#Определить, на каких местах алфавита они стоят и сколько между ними находится букв.
#
# Author:      DautkhadzhievRKH
#
# Created:     09.03.2019
# Copyright:   (c) DautkhadzhievRKH 2019
# Licence:     <your licence>
#-------------------------------------------------------------------------------
a = ord(input('Первая буква: '))
b = ord(input('Вторая буква: '))
a = a - ord('a') + 1
b = b - ord('a') + 1
print('Позиции: {0} и {1} соответственно'.format(a,b))
print('Количество символов между этими буквами:', abs(a-b)-1)
