#-------------------------------------------------------------------------------
# Name:        task1
# Purpose: Найти сумму и произведение цифр трехзначного числа, которое вводит пользователь
#
# Author:      DautkhadzhievRKH
#
# Created:     09.03.2019
# Copyright:   (c) DautkhadzhievRKH 2019
# Licence:     <your licence>
#-------------------------------------------------------------------------------
print('Введите трехзначное число')
n = str(input())
if len(n) < 3 or len(n) > 3:
    print('Ошибка. Неправильно задано число!')
else:
    n = int(n)
    s = n // 100 + (n // 10) % 10 + n % 10 #сумма цифр
    p = (n // 100) * ((n // 10) % 10) * (n % 10) #произведение цифр
    print('Сумма цифр = {0}, произведение цифр = {1}'.format(s,p))

