#-------------------------------------------------------------------------------
# Name:        task1
# Purpose: В диапазоне натуральных чисел от 2 до 99 определить, сколько из них кратны любому из чисел в диапазоне от 2 до 9.
#
# Author:      DautkhadzhievRKH
#
# Created:     16.03.2019
# Copyright:   (c) DautkhadzhievRKH 2019
# Licence:     <your licence>
#-------------------------------------------------------------------------------

arr = [0]*8 # инициализируем массив нулями
# далее реализуем задачу с помощью вложенных циклов
for i in range(2, 100):
    for j in range(2, 10):
        if i % j == 0: # проверяем кратность
            arr[j-2] += 1
for i in range(0, len(arr)):
    print('Всего чисел, кратных %d : %d' % (i+2, arr[i]))
    
