#-------------------------------------------------------------------------------
# Name:        task8
# Purpose: Определить, является ли год, который ввел пользователем, високосным или невисокосным.
#
# Author:      DautkhadzhievRKH
#
# Created:     09.03.2019
# Copyright:   (c) DautkhadzhievRKH 2019
# Licence:     <your licence>
#-------------------------------------------------------------------------------

year = int(input('Введите год: '))
if year % 4 == 0 and year % 100 != 0 or year % 400 == 0:
    print('%d - високосный год' % year)
else:
    print('%d - НЕвисокосный год' % year)
