#-------------------------------------------------------------------------------
# Name:        task4
# Purpose: Определить, какое число в массиве встречается чаще всего.
#
# Author:      DautkhadzhievRKH
#
# Created:     16.03.2019
# Copyright:   (c) DautkhadzhievRKH 2019
# Licence:     <your licence>
#-------------------------------------------------------------------------------

from random import random

N = 10 # кол-во эл-в в исходном массиве
M = 50 # кол-во элементов в массиве совпадений
arr = [0] * N # инициализируем исходный массив
freq = [0] * M # инициализируем массив совпадений

# подготовка и вывод исходного массива
for i in range(N):
    arr[i] = int(random() * 30) # заполняем числами 0-30
    print(arr[i], end=' ')
print()

# формируем массив совпадений
for i in range(N):
    freq[arr[i]] +=1
    max = 0
# обработка и вывод результата совпадений
for i in range(M):
    if freq[i] > freq[max]: max = i
if freq[max] == 1:
    print('Нет совпадающих элементов')
else: print('Число %d встречается в массиве %d раз(а)' % (max, freq[max]))





